TSA1/app/Controllers/Pages.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-19'
---
    public function index()
    {
        $TasksModel = new TasksModel();
        $tasks = $TasksModel->where('task_date', date('Y-m-d'))->findAll();