TSA1/app/Controllers/Tasks.php

SELECT *
FROM `tasks`
ORDER BY `task_date` DESC
---
    public function index()
    {
        $TasksModel = new TasksModel();
        $tasks = $TasksModel->orderBy('task_date', 'DESC')->findAll();