TFA3/app/Controllers/Users.php

    public function index()
    {
        $users = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function edit($id)
    {
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'