Midterm/app/Controllers/Customers.php

    public function index()
    {
        $customers = $this->customerModel->findAll();
---
SELECT *
FROM `customers`