TSA2/app/Controllers/Tasks.php

SELECT *
FROM `tasks`
WHERE `is_archived` = 0
ORDER BY `task_date` ASC
---
    public function index()
    {
        $data['tasks'] = $this->tasksModel
            ->where('is_archived', 0)
            ->orderBy('task_date', 'ASC')
            ->findAll();