TSA2/app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $UsersModel = new UsersModel();
        $users['users'] = $UsersModel->findAll();